; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=201, out_folder=./training, instance_id=27, seed=2051, goal_proportion=0.03

(define (problem blocksworld-27)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 - object)
 (:init 
    (arm-empty)
    (clear b65)
    (on b65 b80)
    (on b80 b33)
    (on b33 b109)
    (on b109 b174)
    (on-table b174)
    (clear b179)
    (on b179 b141)
    (on b141 b49)
    (on b49 b82)
    (on b82 b155)
    (on b155 b54)
    (on b54 b30)
    (on-table b30)
    (clear b168)
    (on b168 b34)
    (on-table b34)
    (clear b95)
    (on b95 b21)
    (on b21 b41)
    (on b41 b9)
    (on b9 b199)
    (on b199 b200)
    (on-table b200)
    (clear b128)
    (on b128 b79)
    (on b79 b132)
    (on b132 b8)
    (on b8 b115)
    (on b115 b130)
    (on b130 b96)
    (on b96 b20)
    (on-table b20)
    (clear b173)
    (on b173 b145)
    (on b145 b167)
    (on-table b167)
    (clear b58)
    (on b58 b63)
    (on b63 b156)
    (on-table b156)
    (clear b196)
    (on b196 b52)
    (on-table b52)
    (clear b103)
    (on b103 b195)
    (on b195 b143)
    (on b143 b144)
    (on-table b144)
    (clear b164)
    (on b164 b76)
    (on-table b76)
    (clear b176)
    (on b176 b28)
    (on-table b28)
    (clear b44)
    (on b44 b86)
    (on b86 b50)
    (on b50 b91)
    (on b91 b60)
    (on b60 b24)
    (on b24 b13)
    (on-table b13)
    (clear b11)
    (on b11 b166)
    (on b166 b107)
    (on b107 b22)
    (on b22 b14)
    (on b14 b66)
    (on b66 b7)
    (on b7 b106)
    (on-table b106)
    (clear b150)
    (on b150 b162)
    (on b162 b193)
    (on b193 b138)
    (on-table b138)
    (clear b184)
    (on b184 b72)
    (on b72 b15)
    (on-table b15)
    (clear b69)
    (on b69 b198)
    (on b198 b38)
    (on-table b38)
    (clear b197)
    (on b197 b131)
    (on b131 b42)
    (on b42 b190)
    (on b190 b35)
    (on b35 b5)
    (on-table b5)
    (clear b127)
    (on b127 b189)
    (on-table b189)
    (clear b73)
    (on b73 b149)
    (on b149 b2)
    (on b2 b170)
    (on-table b170)
    (clear b62)
    (on b62 b182)
    (on b182 b67)
    (on-table b67)
    (clear b36)
    (on b36 b100)
    (on-table b100)
    (clear b157)
    (on-table b157)
    (clear b43)
    (on-table b43)
    (clear b37)
    (on b37 b19)
    (on b19 b27)
    (on b27 b51)
    (on b51 b191)
    (on b191 b129)
    (on b129 b114)
    (on-table b114)
    (clear b101)
    (on b101 b171)
    (on b171 b61)
    (on b61 b160)
    (on b160 b177)
    (on-table b177)
    (clear b57)
    (on b57 b18)
    (on b18 b17)
    (on b17 b125)
    (on b125 b148)
    (on b148 b78)
    (on b78 b122)
    (on b122 b71)
    (on b71 b154)
    (on b154 b64)
    (on-table b64)
    (clear b55)
    (on-table b55)
    (clear b47)
    (on b47 b90)
    (on b90 b94)
    (on b94 b201)
    (on-table b201)
    (clear b93)
    (on-table b93)
    (clear b77)
    (on b77 b70)
    (on b70 b88)
    (on b88 b161)
    (on b161 b133)
    (on b133 b180)
    (on b180 b26)
    (on b26 b181)
    (on-table b181)
    (clear b135)
    (on-table b135)
    (clear b116)
    (on b116 b147)
    (on b147 b97)
    (on b97 b4)
    (on b4 b48)
    (on b48 b74)
    (on b74 b25)
    (on-table b25)
    (clear b169)
    (on b169 b98)
    (on b98 b134)
    (on b134 b188)
    (on b188 b108)
    (on b108 b46)
    (on b46 b183)
    (on-table b183)
    (clear b105)
    (on-table b105)
    (clear b172)
    (on b172 b1)
    (on b1 b102)
    (on b102 b124)
    (on b124 b68)
    (on b68 b186)
    (on b186 b163)
    (on b163 b140)
    (on b140 b153)
    (on b153 b16)
    (on b16 b158)
    (on b158 b120)
    (on b120 b121)
    (on-table b121)
    (clear b152)
    (on b152 b75)
    (on b75 b194)
    (on b194 b187)
    (on b187 b56)
    (on b56 b110)
    (on b110 b81)
    (on-table b81)
    (clear b137)
    (on b137 b31)
    (on b31 b165)
    (on b165 b175)
    (on-table b175)
    (clear b192)
    (on b192 b84)
    (on b84 b3)
    (on b3 b59)
    (on b59 b146)
    (on b146 b126)
    (on-table b126)
    (clear b6)
    (on b6 b92)
    (on b92 b159)
    (on b159 b12)
    (on b12 b123)
    (on b123 b178)
    (on b178 b104)
    (on b104 b99)
    (on-table b99)
    (clear b113)
    (on b113 b89)
    (on b89 b119)
    (on b119 b83)
    (on-table b83)
    (clear b151)
    (on b151 b10)
    (on b10 b136)
    (on b136 b118)
    (on b118 b32)
    (on b32 b85)
    (on b85 b40)
    (on-table b40)
    (clear b185)
    (on b185 b39)
    (on-table b39)
    (clear b112)
    (on b112 b142)
    (on b142 b45)
    (on b45 b29)
    (on b29 b23)
    (on-table b23)
    (clear b87)
    (on b87 b117)
    (on b117 b139)
    (on b139 b111)
    (on b111 b53)
    (on-table b53))
 (:goal  (and 
    (clear b6)
    (on-table b6)
    (clear b2)
    (on-table b2)
    (clear b3)
    (on b3 b1)
    (on-table b1)
    (clear b5)
    (on b5 b4)
    (on-table b4))))

; plan
1. (unstack b6 b92)
   deleted: (on b6 b92) (clear b6) (arm-empty)
   added: (holding b6) (clear b92)
   goals met: 0 of 10
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 10
3. (unstack b116 b147)
   deleted: (on b116 b147) (clear b116) (arm-empty)
   added: (holding b116) (clear b147)
   goals met: 2 of 10
4. (putdown b116)
   deleted: (holding b116)
   added: (clear b116) (arm-empty) (on-table b116)
   goals met: 2 of 10
5. (unstack b147 b97)
   deleted: (on b147 b97) (clear b147) (arm-empty)
   added: (holding b147) (clear b97)
   goals met: 2 of 10
6. (putdown b147)
   deleted: (holding b147)
   added: (clear b147) (arm-empty) (on-table b147)
   goals met: 2 of 10
7. (unstack b172 b1)
   deleted: (on b172 b1) (clear b172) (arm-empty)
   added: (holding b172) (clear b1)
   goals met: 2 of 10
8. (putdown b172)
   deleted: (holding b172)
   added: (clear b172) (arm-empty) (on-table b172)
   goals met: 2 of 10
9. (unstack b1 b102)
   deleted: (on b1 b102) (clear b1) (arm-empty)
   added: (holding b1) (clear b102)
   goals met: 2 of 10
10. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 10
11. (unstack b192 b84)
   deleted: (on b192 b84) (clear b192) (arm-empty)
   added: (holding b192) (clear b84)
   goals met: 3 of 10
12. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 3 of 10
13. (unstack b197 b131)
   deleted: (on b197 b131) (clear b197) (arm-empty)
   added: (holding b197) (clear b131)
   goals met: 3 of 10
14. (putdown b197)
   deleted: (holding b197)
   added: (clear b197) (arm-empty) (on-table b197)
   goals met: 3 of 10
15. (unstack b131 b42)
   deleted: (on b131 b42) (clear b131) (arm-empty)
   added: (holding b131) (clear b42)
   goals met: 3 of 10
16. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 3 of 10
17. (unstack b42 b190)
   deleted: (on b42 b190) (clear b42) (arm-empty)
   added: (holding b42) (clear b190)
   goals met: 3 of 10
18. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 3 of 10
19. (unstack b190 b35)
   deleted: (on b190 b35) (clear b190) (arm-empty)
   added: (holding b190) (clear b35)
   goals met: 3 of 10
20. (putdown b190)
   deleted: (holding b190)
   added: (clear b190) (arm-empty) (on-table b190)
   goals met: 3 of 10
21. (unstack b35 b5)
   deleted: (on b35 b5) (clear b35) (arm-empty)
   added: (holding b35) (clear b5)
   goals met: 4 of 10
22. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 4 of 10
23. (unstack b73 b149)
   deleted: (on b73 b149) (clear b73) (arm-empty)
   added: (holding b73) (clear b149)
   goals met: 4 of 10
24. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 4 of 10
25. (unstack b149 b2)
   deleted: (on b149 b2) (clear b149) (arm-empty)
   added: (holding b149) (clear b2)
   goals met: 5 of 10
26. (putdown b149)
   deleted: (holding b149)
   added: (clear b149) (arm-empty) (on-table b149)
   goals met: 5 of 10
27. (unstack b2 b170)
   deleted: (on b2 b170) (clear b2) (arm-empty)
   added: (holding b2) (clear b170)
   goals met: 4 of 10
28. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 10
29. (unstack b84 b3)
   deleted: (on b84 b3) (clear b84) (arm-empty)
   added: (holding b84) (clear b3)
   goals met: 7 of 10
30. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 7 of 10
31. (unstack b97 b4)
   deleted: (on b97 b4) (clear b97) (arm-empty)
   added: (holding b97) (clear b4)
   goals met: 7 of 10
32. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 7 of 10
33. (unstack b4 b48)
   deleted: (on b4 b48) (clear b4) (arm-empty)
   added: (holding b4) (clear b48)
   goals met: 7 of 10
34. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 8 of 10
35. (unstack b3 b59)
   deleted: (on b3 b59) (clear b3) (arm-empty)
   added: (holding b3) (clear b59)
   goals met: 7 of 10
36. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 9 of 10
37. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 8 of 10
38. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 10 of 10
